app/controllers/admin/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "firstname", "lastname", "admin") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "email" = ?, "firstname" = ?, "lastname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "kaiguo1988@gmail.com"], ["firstname", "chaochen"], ["lastname", "feng"], ["updated_at", 2016-08-18 20:06:05 UTC], ["id", 1]]