app/views/users/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 2]]
---
<h3>Reviews: </h3>
<% @user.reviews.each do |review| %>