app/controllers/movies_controller.rb

  def index
    # binding.pry
    @movies = Movie.all
    if params[:keyword]
      @movies = Movie.title_or_director_like(params[:keyword])
    end
    # if params[:director]
    #   @movies = @movies.director_like(params[:director])
    # end
    case params[:duration]
      when 'short'
        @movies = @movies.duration_less_than_90
      when 'medium'
        @movies = @movies.duration_between_90_and_120
      when 'long'
        @movies = @movies.duration_longer_than_120
      else
    end

    @movies = @movies.order(:title).page params[:page]
---
SELECT "movies".* FROM "movies" WHERE (title like '%asd%' AND director like '%%' AND runtime_in_minutes like '%%')
SELECT  "movies".* FROM "movies" WHERE (title like '%%' AND director like '%%') AND (runtime_in_minutes >= 90 AND runtime_in_minutes <= 120) ORDER BY "movies"."title" ASC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "movies" WHERE (title like '%%' or director like '%%') AND (runtime_in_minutes >= 90 AND runtime_in_minutes <= 120) LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 5], ["OFFSET", 0]]

  def create
    @movie = Movie.new(movie_params)

    if @movie.save
---
INSERT INTO "movies" ("title", "director", "runtime_in_minutes", "description", "poster_image_url", "release_date", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find(params[:id])

    if @movie.update_attributes(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "runtime_in_minutes" = ?, "updated_at" = ?, "image" = ? WHERE "movies"."id" = ?  [["runtime_in_minutes", 119], ["updated_at", 2016-08-17 15:23:44 UTC], ["image", "031.png"], ["id", 3]]