app/views/admin/users/index.html.erb

  <tbody>
    <% User.all.each do |u|%>
---
SELECT "users".* FROM "users"